app/views/photos/_comment_index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 3]]
---
<div>
  <% photo.comments.each do |c| %>