app/views/photos/show.html.erb

          <i class="bi bi-balloon-heart-fill text-danger"></i>
          <span class="text-secondary"><%= @photo.favorites.count %></span>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 3]]

          <i class="bi bi-chat text-primary pr-1"></i>
          <span class="text-secondary"><%= @photo.comments.count %></span>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 3]]

    <div>
      <% @photo.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 3]]