app/controllers/comments_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "photo_id", "post_comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["photo_id", 3], ["post_comment", "@@@"], ["created_at", "2022-02-09 13:23:33.842091"], ["updated_at", "2022-02-09 13:23:33.842091"]]
---
  def create
    @photo = Photo.find(params[:photo_id])
    @comment = current_user.comments.new(comment_params)
    @comment.photo_id = @photo.id
    if @comment.save