app/controllers/photos_controller.rb

  def create
    @photo = Photo.create(photo_params)
    @photo.user_id = current_user.id
    if @photo.save
---
INSERT INTO "photos" ("picture_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "photos" SET "user_id" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["user_id", 1], ["updated_at", "2022-02-09 04:36:58.197312"], ["id", 2]]

  def index
    # タグをクリックした場合の分岐
    if params[:tag_name]
      @tag_exists = "OK"
      flash.now[:info] = "「#{params[:tag_name]}」タグの絞り込みを行いました"
      @photos = Photo.tagged_with("#{params[:tag_name]}")
      @photo_new = @photos.page(params[:photo]).order("created_at DESC").per(6)
    else
      # 通常、投稿一覧はこの内容を実行
      @photos = Photo.includes(:user)
      @photo_new = @photos.page(params[:photo]).order("created_at DESC").per(6)
      # いいね上位
      photo_like = Photo.find(Favorite.group(:photo_id).order("count(photo_id) DESC").limit(3).pluck(:photo_id))
      @photo_like_active = photo_like.first
      @photo_like = photo_like.last(2)
      # コメント上位
      photo_comment = Photo.find(Comment.group(:photo_id).order("count(photo_id) DESC").limit(3).pluck(:photo_id))
      @photo_comment_active = photo_comment.first
---
SELECT COUNT(*) FROM "photos"
SELECT  "photos".* FROM "photos" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 3]]

  def show
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 3]]