app/controllers/photos_controller.rb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('tag') OR LOWER(name) = LOWER('sakana') OR LOWER(name) = LOWER('sakaka'))
---
  def index
    if params[:tag_name]
      flash[:info] = "「#{params[:tag_name]}」タグの絞り込みを行いました"
      @photos = Photo.tagged_with("#{params[:tag_name]}")
      @photo_new = @photos.page(params[:photo]).order("created_at DESC").per(6)
    else
      @photos = Photo.all