app/controllers/photos_controller.rb

DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 3]]
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy